In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [15]:
df['A'].fillna(value=df['A'].median(),inplace=True)

In [16]:
df['B'].fillna(value=df['B'].median(),inplace=True)

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [27]:
df['A'].fillna(value=df['A'].mode())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [28]:
df['B'].fillna(value=df['B'].mode())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [ ]:
what is the difference between merging and joining in dataframe

In [ ]:
Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their 
indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both 
dataframes.

In [ ]:
Create a dataframe and add a column, add names in it and use apply function to return names whose length is greater than 5

In [31]:
names=['Ramya', 'Rama lakshmi', 'Sruthi']

In [32]:
df['Names'] = names

In [33]:
df

     A    B  C         Names
0  1.0  5.0  1         Ramya
1  2.0  5.0  2  Rama lakshmi
2  1.5  5.0  3        Sruthi

In [35]:
df[df['Names'].str.len() > 5]

     A    B  C         Names
1  2.0  5.0  2  Rama lakshmi
2  1.5  5.0  3        Sruthi

In [ ]:
create a numpy array and a dataframe array and concatenate them

In [40]:
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [43]:
data = pd.DataFrame({'X':[1,2,7],
                  'Y':[5,5, 2],
                  'Z':[1,2,3]})

In [44]:
data

   X  Y  Z
0  1  5  1
1  2  5  2
2  7  2  3

In [46]:
new_dataframe = pd.concat([
    data,
    pd.DataFrame(np.ones((3,3)), dtype=np.int)
], axis=1, ignore_index=True)

In [47]:
new_dataframe

   0  1  2  3  4  5
0  1  5  1  1  1  1
1  2  5  2  1  1  1
2  7  2  3  1  1  1